app/controllers/school_classes_controller.rb

  def update
    @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2016-08-19 18:32:53.274091"], ["id", 1]]

  def set_school_class
      @school_class=SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]